Project/Toir/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/торо_ЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ЗакрытиеЗаявокИРемонтов</name>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>AccumulationRegister.торо_ПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.торо_ОтмененныеЗаявки</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявокУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_ОтмененныеРемонты</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявок</registerRecords>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ППРИнициатор</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакрываемыеЗаявки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перенесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыДокументовЗаявок/торо_СтатусыДокументовЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыДокументовЗаявок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусУстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыДокументовЗаявокУстановленные/торо_СтатусыДокументовЗаявокУстановленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыДокументовЗаявокУстановленные</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыДокументовВыявленныхДефектов/торо_СтатусыДокументовВыявленныхДефектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыДокументовВыявленныхДефектов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусУстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыДокументовВыявленныхДефектовУстановленные/торо_СтатусыДокументовВыявленныхДефектовУстановленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыДокументовВыявленныхДефектовУстановленные</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеЗаявки/торо_ОтмененныеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеЗаявки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыРемонтовВЗаявках/торо_СтатусыРемонтовВЗаявках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыРемонтовВЗаявках</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийКСтатусу</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаРемонт</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_ПроцентВыполненныхРабот/торо_ПроцентВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ПроцентВыполненныхРабот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.торо_ВидДокумента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Если Не Отказ Тогда
		УстановитьУправляемыеБлокировки();
		ДвиженияПоРегистрам(Отказ);
		Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ИзОбработки") Тогда
			торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ИзОбработки") И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ ПометкаУдаления И Проведен Тогда
		
		УстановитьУправляемыеБлокировки();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID КАК ID
		|ПОМЕСТИТЬ ТаблицаДокумента
		|ИЗ
		|	Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты
		|ГДЕ
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ торо_ПлановыеРЕмонтныеРаботы
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					ТаблицаДокумента.ID КАК ID
		|				ИЗ
		|					ТаблицаДокумента КАК ТаблицаДокумента)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		|ГДЕ
		|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
		|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеРЕмонтныеРаботы.Период КАК Период,
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID КАК ID,
		|	торо_ПлановыеРЕмонтныеРаботы.Регистратор КАК Регистратор
		|ИЗ
		|	ТаблицаДокумента КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ торо_ПлановыеРЕмонтныеРаботы КАК торо_ПлановыеРЕмонтныеРаботы
		|		ПО торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID = торо_ПлановыеРЕмонтныеРаботы.ID
		|ГДЕ
		|	торо_ПлановыеРЕмонтныеРаботы.Период >= &ДатаДокумента
		|	И торо_ПлановыеРЕмонтныеРаботы.Регистратор <> &Ссылка";
					   
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ДатаДокумента", Дата);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр("es='¡Es imposible anular la realización del documento, porque a algunas reparaciones trasladadas son introducidos ya los nuevos documentos de la planificación!';ru='Невозможно отменить проведение документа, т.к. на некоторые перемещенные ремонты уже введены новые документы планирования!';en='Unable to cancel the document because new planning documents have already been introduced for some relocated repairs!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ППРИнициатор) И ППРИнициатор.Проведен Тогда
			ТекстСообщения = НСтр("es='¡Es imposible anular la realización del documento, porque el plan-gráfico ППР, a que cálculo él era creado, es pasado ya!';ru='Невозможно отменить проведение документа, т.к. план-график ППР, при расчете которого он был создан, уже проведен!';en='Unable to cancel the document because the schedule of PPM, in the calculation of which it was created, has already been done!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	торо_РаботаСоСтатусамиДокументовСервер.ОтменаПроведения(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ДвиженияПоРегистрам(Отказ)	
	ДвиженияПоРегистру_торо_ОтмененныеРемонты(Отказ);	
	ДвиженияПоРегистру_торо_ОтмененныеЗаявки(Отказ);
	ДвиженияПоРегистру_торо_ПлановыеРемонтныеРаботы(Отказ);
	ДвиженияПоРегистру_торо_ПроцентВыполненияРабот(Отказ);
КонецПроцедуры

Процедура ДвижениеПоРегистру_торо_СтатусыДокументовЗаявка(Отказ, Заявка, Статус)
	Движение = Движения.торо_СтатусыДокументовЗаявок.Добавить();
	Движение.Период = Дата;
	Движение.ИзменяемыйДокумент = Заявка;
	Движение.СтатусДокумента = Статус;
	Движение.СтатусУстановлен = Истина;
	Если Не Отказ Тогда
		Движения.торо_СтатусыДокументовЗаявок.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ДвижениеПоРегистру_торо_СтатусыДокументовЗаявкаУстановленные(Отказ, Заявка, Статус)
	Движение = Движения.торо_СтатусыДокументовЗаявокУстановленные.Добавить();
	Движение.Период = Дата;
	Движение.ИзменяемыйДокумент = Заявка;
	Движение.СтатусДокумента = Статус;
	Если Не Отказ Тогда
		Движения.торо_СтатусыДокументовЗаявокУстановленные.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ДвижениеПоРегистру_торо_СтатусыДокументовВыявленныхДефектов(Ссылка)
	Движение = Движения.торо_СтатусыДокументовВыявленныхДефектов.Добавить();
	Движение.Период = Дата;
	Движение.ИзменяемыйДокумент = Ссылка;
	Движение.СтатусДокумента = Перечисления.торо_СтатусыДокументов.Отклонен;
	Движение.СтатусУстановлен = Истина;
	Движения.торо_СтатусыДокументовВыявленныхДефектов.Записать();
КонецПроцедуры

Процедура ДвижениеПоРегистру_торо_СтатусыДокументовВыявленныхДефектовУстановленные(Ссылка)
	Движение = Движения.торо_СтатусыДокументовВыявленныхДефектовУстановленные.Добавить();
	Движение.Период = Дата;
	Движение.ИзменяемыйДокумент = Ссылка;
	Движение.СтатусДокумента = Перечисления.торо_СтатусыДокументов.Отклонен;
	Движения.торо_СтатусыДокументовВыявленныхДефектовУстановленные.Записать();
КонецПроцедуры

Процедура ДвиженияПоРегистру_торо_ОтмененныеЗаявки(Отказ)
	Если не Отказ Тогда		
		Для Каждого Строка Из ЗакрываемыеЗаявки Цикл
			Движение = Движения.торо_ОтмененныеЗаявки.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			
			НаборЗаписейСтатусовРемонтов = РегистрыСведений.торо_СтатусыРемонтовВЗаявках.СоздатьНаборЗаписей();
			НаборЗаписейСтатусовРемонтов.Отбор.ЗаявкаНаРемонт.Установить(Строка.Заявка);
			НаборЗаписейСтатусовРемонтов.Прочитать();
			Запись = НаборЗаписейСтатусовРемонтов.Добавить();
			Запись.ЗаявкаНаРемонт = Строка.Заявка;
			Запись.ИДРемонта = Строка.ИДРемонта;
			Запись.Период = Дата;
			Запись.Пользователь = Пользователи.ТекущийПользователь();
			Если ЗакрываемыеРемонты.Найти(Строка.ИДРемонта) <> Неопределено Тогда
				Запись.Статус = Перечисления.торо_СтатусыДокументов.Отклонен;
			Иначе
				Запись.Статус = Перечисления.торо_СтатусыДокументов.ПустаяСсылка();
				Запись.КомментарийКСтатусу = "Заявка закрыта";
			КонецЕсли;	
			
			НаборЗаписейСтатусовРемонтов.Записать();
			
			ЗакрытьЗаявку = Истина;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(, ЗаявкаНаРемонт = &Ссылка) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних";
			Запрос.УстановитьПараметр("Ссылка", Строка.Заявка);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если НЕ (Выборка.Статус = Перечисления.торо_СтатусыДокументов.Отклонен
					ИЛИ Выборка.Статус = Перечисления.торо_СтатусыДокументов.ПустаяСсылка()) Тогда
					ЗакрытьЗаявку = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;

			Если ЗакрытьЗаявку Тогда
				ДвижениеПоРегистру_торо_СтатусыДокументовЗаявка(Отказ, Строка.Заявка, Перечисления.торо_СтатусыДокументов.Отклонен);
				ДвижениеПоРегистру_торо_СтатусыДокументовЗаявкаУстановленные(Отказ, Строка.Заявка, Перечисления.торо_СтатусыДокументов.Отклонен);
			КонецЕсли;
			
		КонецЦикла;
		Движения.торо_ОтмененныеЗаявки.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ДвиженияПоРегистру_торо_ОтмененныеРемонты(Отказ)
	ВыявленныеДефекты = Новый СписокЗначений;
	Для Каждого Строка Из ЗакрываемыеРемонты Цикл
		Движение = Движения.торо_ОтмененныеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.Период = Дата;
		Если ТипЗнч(Строка.ДокументОснование) = Тип ("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			ВыявленныеДефекты.Добавить(Строка.ДокументОснование);
		КонецЕсли;
	КонецЦикла;
	Если Не Отказ Тогда
		Движения.торо_ОтмененныеРемонты.Записать();
		ПроверитьСтатусыВыявленныхДефектов(ВыявленныеДефекты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистру_торо_ПлановыеРемонтныеРаботы(Отказ)
	
	ТаблицаСоответствияID = ПолучитьТаблицуСоответствияIDРемонтовIDКорректировок();
	
	Если ТаблицаСоответствияID.Количество() > 0 Тогда
		
		Для Каждого ИсходнаяСтрока Из ЗакрываемыеРемонты Цикл
			ТаблицаРегистр = ТаблицаСоответствияID.НайтиСтроки(Новый Структура("ID", ИсходнаяСтрока.ID));
			Если ТаблицаРегистр.Количество() > 0 Тогда
				СтрокаРегистр = ТаблицаРегистр[0];
				
				Движение = Движения.торо_ПлановыеРемонтныеРаботы.Добавить();
				Движение.ID = СтрокаРегистр.ID;
				Движение.ВидРемонтныхРабот = СтрокаРегистр.ВидРемонтныхРабот;
				Движение.ОбъектРемонтныхРабот = СтрокаРегистр.ОбъектРемонтныхРабот;
				Движение.Организация = СтрокаРегистр.Организация;
				Движение.Подразделение = СтрокаРегистр.Подразделение;
				Движение.ДатаНачалаРасчетная = СтрокаРегистр.ДатаНачалаРасчетная;
				Движение.Замещен = СтрокаРегистр.Замещен;
				Движение.Исполнитель = СтрокаРегистр.Исполнитель;
				Движение.Отменен = ИсходнаяСтрока.Отменен;
				Движение.СпособВыполнения = СтрокаРегистр.СпособВыполнения;
				Движение.СтоимостьРемонта = СтрокаРегистр.СтоимостьРемонта;
				Движение.ID_базы_расчета = СтрокаРегистр.ID_базы_расчета;
				Движение.ID_замещающего = СтрокаРегистр.ID_замещающего;
				Если ИсходнаяСтрока.Перенесен Тогда
					Движение.ДатаНачалаРемонтныхРабот = ИсходнаяСтрока.НоваяДатаНачала;
					Движение.ДатаОкончанияРемонтныхРабот = ИсходнаяСтрока.НоваяДатаОкончания;
				Иначе
					Движение.ДатаНачалаРемонтныхРабот = СтрокаРегистр.ДатаНачалаРемонтныхРабот;
					Движение.ДатаОкончанияРемонтныхРабот = СтрокаРегистр.ДатаОкончанияРемонтныхРабот;
				КонецЕсли;
				Движение.Период = СтрокаРегистр.Период+1;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
	Если Не Отказ Тогда
		Движения.торо_ПлановыеРемонтныеРаботы.Записать();
	КонецЕсли;
		
КонецПроцедуры

Процедура ДвиженияПоРегистру_торо_ПроцентВыполненияРабот(Отказ)
	
	Движения.торо_ПроцентВыполненныхРабот.Записывать = Истина;
	
	Для каждого Заявка Из ЗакрываемыеЗаявки Цикл
	
		ТаблицаРемонтныхРабот = Заявка.Заявка.РемонтныеРаботы;
	
		Для каждого Стр Из ТаблицаРемонтныхРабот Цикл
			
			Если ТипЗнч(Стр.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации")
				И ЗакрываемыеРемонты.Найти(Стр.РемонтыОборудования_ID) <> Неопределено Тогда
				Движение = Движения.торо_ПроцентВыполненныхРабот.Добавить();
				Движение.Период = Дата;
				Движение.IDРемонта = Стр.РемонтыОборудования_ID;
				Движение.IDОперации = Стр.ID;
				Движение.Операция = Стр.РемонтнаяРабота;
				Движение.IDРодителя = Стр.Родитель_ID;
				Движение.Процент = - Стр.Количество * 100;
				Движение.ВидДокумента = Перечисления.торо_ВидДокумента.ЗакрытиеЗаявокИРемонтов;			
			КонецЕсли; 
		КонецЦикла;		
	КонецЦикла; 
	
	Если Не Отказ Тогда
		Движения.торо_ПроцентВыполненныхРабот.Записать();
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьТаблицуСоответствияIDРемонтовIDКорректировок()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Период КАК Период,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.НомерСтроки КАК НомерСтроки,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Активность КАК Активность,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Организация КАК Организация,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.СпособВыполнения КАК СпособВыполнения,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен КАК Отменен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID_базы_расчета КАК ID_базы_расчета,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен КАК Замещен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID_замещающего КАК ID_замещающего,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.СтоимостьРемонта КАК СтоимостьРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В (&СписокID)
	|				И Регистратор <> &Ссылка) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен";
	
	Запрос.УстановитьПараметр("СписокID", ЗакрываемыеРемонты.ВыгрузитьКолонку("ID"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура УстановитьУправляемыеБлокировки()
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.торо_ПлановыеРемонтныеРаботы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ЗакрываемыеРемонты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
		
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура ПроверитьСтатусыВыявленныхДефектов(ВыявленныеДефекты)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
	               |	торо_ВыявленныеДефектыСписокДефектов.ID КАК IDДефекта,
	               |	ЕСТЬNULL(торо_ОтмененныеРемонтыСрезПоследних.ID,"""") КАК IDОтмененный
	               |ИЗ
	               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
	               |		ПО торо_ВыявленныеДефектыСписокДефектов.ID = торо_ОтмененныеРемонтыСрезПоследних.ID
	               |ГДЕ
	               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&ВыявленныеДефекты) 
	               |ИТОГИ ПО
	               |	Ссылка";
	Запрос.УстановитьПараметр("ВыявленныеДефекты", ВыявленныеДефекты);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	Пока ВыборкаДокументов.Следующий() Цикл
		ВыборкаДефектов = ВыборкаДокументов.Выбрать();
		ЗакрытьДокумент = Истина;
		Пока ВыборкаДефектов.Следующий() Цикл
			Если ВыборкаДефектов.IDДефекта <> ВыборкаДефектов.IDОтмененный Тогда
				ЗакрытьДокумент = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗакрытьДокумент Тогда
			ДвижениеПоРегистру_торо_СтатусыДокументовВыявленныхДефектов(ВыборкаДокументов.Ссылка);
			ДвижениеПоРегистру_торо_СтатусыДокументовВыявленныхДефектовУстановленные(ВыборкаДокументов.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
